const ItemOptions: Record<string, Object> = {
  Categories: [
    {
      Subs: [],
      Code: 10100,
      CodeName: '장비 상자',
    },
    {
      Subs: [
        {
          Code: 20005,
          CodeName: '무기',
        },
        {
          Code: 20010,
          CodeName: '머리',
        },
        {
          Code: 20020,
          CodeName: '얼굴1',
        },
        {
          Code: 20030,
          CodeName: '얼굴2',
        },
        {
          Code: 20050,
          CodeName: '상의',
        },
        {
          Code: 20060,
          CodeName: '하의',
        },
        {
          Code: 20070,
          CodeName: '상하의 세트',
        },
        {
          Code: 21400,
          CodeName: '악기',
        },
        {
          Code: 21500,
          CodeName: '아바타 상자',
        },
        {
          Code: 21600,
          CodeName: '이동 효과',
        },
      ],
      Code: 20000,
      CodeName: '아바타',
    },
    {
      Subs: [],
      Code: 40000,
      CodeName: '각인서',
    },
    {
      Subs: [
        {
          Code: 50010,
          CodeName: '재련 재료',
        },
        {
          Code: 50020,
          CodeName: '재련 추가 재료',
        },
        {
          Code: 51000,
          CodeName: '기타 재료',
        },
        {
          Code: 51100,
          CodeName: '무기 진화 재료',
        },
      ],
      Code: 50000,
      CodeName: '강화 재료',
    },
    {
      Subs: [
        {
          Code: 60200,
          CodeName: '배틀 아이템 -회복형',
        },
        {
          Code: 60300,
          CodeName: '배틀 아이템 -공격형',
        },
        {
          Code: 60400,
          CodeName: '배틀 아이템 -기능성',
        },
        {
          Code: 60500,
          CodeName: '배틀 아이템 -버프형',
        },
      ],
      Code: 60000,
      CodeName: '전투 용품',
    },
    {
      Subs: [],
      Code: 70000,
      CodeName: '요리',
    },
    {
      Subs: [
        {
          Code: 90200,
          CodeName: '식물채집 전리품',
        },
        {
          Code: 90300,
          CodeName: '벌목 전리품',
        },
        {
          Code: 90400,
          CodeName: '채광 전리품',
        },
        {
          Code: 90500,
          CodeName: '수렵 전리품',
        },
        {
          Code: 90600,
          CodeName: '낚시 전리품',
        },
        {
          Code: 90700,
          CodeName: '고고학 전리품',
        },
        {
          Code: 90800,
          CodeName: '기타',
        },
      ],
      Code: 90000,
      CodeName: '생활',
    },
    {
      Subs: [],
      Code: 100000,
      CodeName: '모험의 서',
    },
    {
      Subs: [
        {
          Code: 110100,
          CodeName: '선박 재료',
        },
        {
          Code: 110110,
          CodeName: '선박 스킨',
        },
        {
          Code: 111900,
          CodeName: '선박 재료 상자',
        },
      ],
      Code: 110000,
      CodeName: '항해',
    },
    {
      Subs: [
        {
          Code: 140100,
          CodeName: '펫',
        },
        {
          Code: 140200,
          CodeName: '펫 상자',
        },
      ],
      Code: 140000,
      CodeName: '펫',
    },
    {
      Subs: [
        {
          Code: 160100,
          CodeName: '탈것',
        },
        {
          Code: 160200,
          CodeName: '탈것 상자',
        },
      ],
      Code: 160000,
      CodeName: '탈것',
    },
    {
      Subs: [],
      Code: 170000,
      CodeName: '기타',
    },
    {
      Subs: [],
      Code: 220000,
      CodeName: '보석 상자',
    },
  ],
  ItemGrades: ['일반', '고급', '희귀', '영웅', '전설', '유물', '고대', '에스더'],
  ItemTiers: [2, 3, 4],
  Classes: [
    '버서커',
    '디스트로이어',
    '워로드',
    '홀리나이트',
    '슬레이어',
    '아르카나',
    '서머너',
    '바드',
    '소서리스',
    '배틀마스터',
    '인파이터',
    '기공사',
    '창술사',
    '스트라이커',
    '브레이커',
    '블레이드',
    '데모닉',
    '리퍼',
    '소울이터',
    '호크아이',
    '데빌헌터',
    '블래스터',
    '스카우터',
    '건슬링어',
    '도화가',
    '기상술사',
  ],
};

export const ItemId: Record<string, number> = {
  '파괴석 조각': 66102001,
  파괴석: 66102002,
  '파괴석 결정': 66102003,
  파괴강석: 66102004,
  '정제된 파괴강석': 66102005,
  '운명의 파괴석': 66102006,
  '수호석 조각': 66102101,
  수호석: 66102102,
  '수호석 결정': 66102103,
  수호강석: 66102104,
  '정제된 수호강석': 66102105,
  '운명의 수호석': 66102106,
  '조화의 돌파석': 66110204,
  '명예의 돌파석': 66110221,
  '위대한 명예의 돌파석': 66110222,
  '경이로운 명예의 돌파석': 66110223,
  '찬란한 명예의 돌파석': 66110224,
  '운명의 돌파석': 66110225,
  '오레하 융화 재료': 6861008,
  '상급 오레하 융화 재료': 6861009,
  '최상급 오레하 융화 재료': 6861011,
  '아비도스 융화 재료': 6861012,
  '조화의 파편 주머니(소)': 66130111,
  '명예의 파편 주머니(소)': 66130131,
  '운명의 파편 주머니(소)': 66130141,
  '조화의 파편 주머니(중)': 66130112,
  '명예의 파편 주머니(중)': 66130132,
  '조화의 파편 주머니(대)': 66130113,
  '명예의 파편 주머니(대)': 66130133,
  '운명의 파편 주머니(중)': 66130142,
  '별의 숨결': 66111104,
  '태양의 은총': 66111121,
  '태양의 축복': 66111122,
  '태양의 가호': 66111123,
  '용암의 숨결': 66111131,
  '빙하의 숨결': 66111132,
  '재봉술 : 비늘 [5-7]': 66112524,
  '재봉술 : 선혈 [8-10]': 66112525,
  '재봉술 : 마수 [11-15]': 66112526,
  '재봉술 : 몽환 [13-15]': 66112534,
  '재봉술 : 몽환 [16-19]': 66112535,
  '재봉술 : 쇠락 [13-15]': 66112544,
  '재봉술 : 쇠락 [16-19]': 66112545,
  '재봉술 : 업화 [11-14]': 66112546,
  '야금술 : 비늘 [5-7]': 66112521,
  '야금술 : 선혈 [8-10]': 66112522,
  '야금술 : 마수 [11-15]': 66112523,
  '야금술 : 몽환 [13-15]': 66112531,
  '야금술 : 몽환 [16-19]': 66112532,
  '야금술 : 쇠락 [13-15]': 66112541,
  '야금술 : 쇠락 [16-19]': 66112542,
  '야금술 : 업화 [11-14]': 66112543,
};
